README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>README</title>
<!-- 2017-12-07 Thu 23:34 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="merlin" />
</head>
<body>
<div id="content">
<h1 class="title">README</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Null Space Labs</a>
<ul>
<li><a href="#sec-1-1">1.1. When are classes held at NSL?</a></li>
<li><a href="#sec-1-2">1.2. Where is NSL?</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Python Classes</a>
<ul>
<li><a href="#sec-2-1">2.1. How much do the classes cost?</a></li>
<li><a href="#sec-2-2">2.2. Prepare your computer before the class</a></li>
<li><a href="#sec-2-3">2.3. Prepare your brain before the class</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Programming 101: Introduction to Python</a>
<ul>
<li><a href="#sec-3-1">3.1. What will we cover?</a>
<ul>
<li><a href="#sec-3-1-1">3.1.1. Topics we'll cover</a></li>
<li><a href="#sec-3-1-2">3.1.2. Projects we'll do</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-4">4. Programming 201: Intermediate Python</a>
<ul>
<li><a href="#sec-4-1">4.1. What will we cover?</a>
<ul>
<li><a href="#sec-4-1-1">4.1.1. Topics we'll review</a></li>
<li><a href="#sec-4-1-2">4.1.2. Topics we'll cover in depth</a></li>
</ul>
</li>
<li><a href="#sec-4-2">4.2. How much does the class cost?</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Programming 301: Advanced Python</a>
<ul>
<li><a href="#sec-5-1">5.1. What will we cover?</a></li>
<li><a href="#sec-5-2">5.2. How much does the class cost?</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Null Space Labs</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="http://032.la">Null Space Labs</a> (or <code>NSL</code>) is a <a href="http://hackerspaces.org/">hacker space</a> in Los Angeles, California.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> When are classes held at NSL?</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Just about every Saturday a class is held.
</p>

<p>
Check out the <a href="http://www.meetup.com/NullSpaceLabs/events/">events on MeetUp</a> to see what is upcoming.
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Where is NSL?</h3>
<div class="outline-text-3" id="text-1-2">
<p>
We are located at <a href="https://www.google.com/maps/place/10717+W+Chandler+Blvd,+North+Hollywood,+CA+91601">10717 West Chandler Blvd in North Hollywood, California</a>:
</p>

<ul class="org-ul">
<li>Check <a href="https://www.google.com/maps/place/10717+W+Chandler+Blvd,+North+Hollywood,+CA+91601">https://www.google.com/maps/place/10717+W+Chandler+Blvd,+North+Hollywood,+CA+91601</a>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Python Classes</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> How much do the classes cost?</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The NSL Python classes vary in price from $30 to $100 each depending on the complexity of the course primarily.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Level</th>
<th scope="col" class="left">Class</th>
<th scope="col" class="left">Cost</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Programming 101</td>
<td class="left">Introduction to Python</td>
<td class="left">$30</td>
</tr>

<tr>
<td class="left">Programming 201</td>
<td class="left">Intermediate Python</td>
<td class="left">$60</td>
</tr>

<tr>
<td class="left">Programming 301</td>
<td class="left">Advanced Python</td>
<td class="left">$100</td>
</tr>
</tbody>
</table>

<p>
You can pay at the door in cash or other electronic methods on site.
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Prepare your computer before the class</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Install the latest Python 3 package from the <a href="http://python.org/download/">official python download page</a>

<ul class="org-ul">
<li><a href="http://python.org/download/">http://python.org/download/</a>
</li>

<li>OR install the latest Python 3 package available through your operating system's package management
</li>
</ul>
</li>

<li>Have your editor of choice or IDE ready to go
</li>

<li>OR just bring an SSH client (Mac, Linux already has it, use <a href="http://www.chiark.greenend.org.uk/~sgtatham/putty/download.html">PuTTY</a> on Windows)

<ul class="org-ul">
<li>With SSH we will provide you a shell with python and some editors
</li>
</ul>
</li>

<li>OR <b>NEW</b> just bring a Web Browser (<a href="https://www.mozilla.org/en-US/firefox/new/">Firefox</a> and <a href="https://www.google.com/chrome/browser/">Chrome</a> should work almost everywhere)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Prepare your brain before the class</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li><a href="http://docs.python.org/3/tutorial/">http://docs.python.org/3/tutorial/</a>
</li>

<li><a href="https://docs.python.org/3/library/idle.html">https://docs.python.org/3/library/idle.html</a>
</li>

<li><a href="http://www.codecademy.com/tracks/python">http://www.codecademy.com/tracks/python</a>
</li>

<li><a href="http://learnpython.org">http://learnpython.org</a>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> <a href="./classes/programming-101-introduction-to-python/">Programming 101: Introduction to Python</a></h2>
<div class="outline-text-2" id="text-3">
<p>
Learn all about programming with the easy-to-learn and use language: Python!
</p>

<p>
This is the first class in a series of three python programming classes appropriate for any hackers interested in computer programming and software development.
</p>

<p>
This class is graciously hosted by NSL Keyholder Merlin!
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> What will we cover?</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Practical Python language basics will be covered from the ground up.
</p>

<p>
At the end of the class we'll work on some adventure games.
</p>
</div>

<div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> Topics we'll cover</h4>
<div class="outline-text-4" id="text-3-1-1">
<ul class="org-ul">
<li>Why Python is BALLER
</li>

<li>How to Python (ensuring everyone has some kind of working Python environment before we start)
</li>

<li>Literals, built-in types, and variables
</li>

<li>Functions, modules, and objects (briefly and shallowly)
</li>

<li>Operators, loops, and conditionals
</li>

<li>Functions, modules, and objects (a bit deeper, as time permits)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> Projects we'll do</h4>
<div class="outline-text-4" id="text-3-1-2">
<ul class="org-ul">
<li>Work on adventure games
</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Programming 201: Intermediate Python</h2>
<div class="outline-text-2" id="text-4">
<p>
Learn all about programming with the easy-to-learn and use language: Python!
</p>

<p>
This is the second class in a series of three python programming classes appropriate for any hackers interested in computer programming and software development.
</p>

<p>
This class is graciously hosted by NSL Keyholder Merlin!
</p>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> What will we cover?</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Python language basics will be reviewed as a refresher for anyone coming from our Python 101 class, and to ensure we're all on the same page before diving into intermediate topics.
</p>

<p>
If you already know basic programming and specifically basic python programming, but want to learn how to actually engineer software in python, this class will be of special interest to you.
</p>

<p>
If you just want to see and experience more of "Why Python is Baller", we'll have some things for you.
</p>

<p>
See below for instructions on what you need before the class (Python and a text editor, basically) as well as some introductory material for those who want to get a head start.
</p>
</div>

<div id="outline-container-sec-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> Topics we'll review</h4>
<div class="outline-text-4" id="text-4-1-1">
<ul class="org-ul">
<li>Why Python is BALLER
</li>

<li>Types, variables, operators, conditionals, loops, functions
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4-1-2" class="outline-4">
<h4 id="sec-4-1-2"><span class="section-number-4">4.1.2</span> Topics we'll cover in depth</h4>
<div class="outline-text-4" id="text-4-1-2">
<ul class="org-ul">
<li>Standard Python Functions

<ul class="org-ul">
<li>Almost all of them!
</li>
</ul>
</li>

<li>Standard Python Libraries

<ul class="org-ul">
<li>A few of them, anyway!
</li>

<li>Also how to learn more about them
</li>
</ul>
</li>

<li>Generators and comprehensions
</li>

<li>Modules and packages
</li>

<li>Command line arguments and interfaces
</li>

<li>Tour of well known powerful libraries
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> How much does the class cost?</h3>
<div class="outline-text-3" id="text-4-2">
<p>
This class costs $50 for anyone who isn't a member of Null Space Labs.
</p>

<p>
You can pay at the door in cash or other electronic methods on site.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Programming 301: Advanced Python</h2>
<div class="outline-text-2" id="text-5">
<p>
Learn all about programming with the easy-to-learn language: Python!
</p>

<p>
This is the third class in a series of three python programming classes appropriate for any hackers interested in computer programming and software development.
</p>

<p>
This class is graciously hosted by NSL Keyholder Merlin!
</p>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> What will we cover?</h3>
<div class="outline-text-3" id="text-5-1">
<p>
This class is currently unspecified!
</p>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> How much does the class cost?</h3>
<div class="outline-text-3" id="text-5-2">
<p>
This class costs $100 for anyone who isn't a member of Null Space Labs.
</p>

<p>
You can pay at the door in cash or other electronic methods on site.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: merlin</p>
<p class="date">Created: 2017-12-07 Thu 23:34</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
